Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་མི་ཟློགས་པའི་བརྩོན་འགྲུས་དང་ལྡན། མཐའ་ཡས་པའི་བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཀྱི་ཤུགས་དང་ལྡན་ཞིང་བརྩོན་འགྲུས་དཔའ་བ་དང་། སེམས་དཔའ་བ་དང་། ཚུལ་ཁྲིམས་དཔའ་བ་དང་། བཟོད་པ་དཔའ་བ་དང་། ཏིང་ངེ་འཛིན་དཔའ་བ་དང་། ཤེས་རབ་དཔའ་བ་དང་། སྤྱོད་པའི་ཁྱད་པར་གྱི་ཡེ་ཤེས་དཔའ་བ་ཞེས་བྱའོ། །དེ་ལ་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་མཚོན་རྣོན་པོ་ཐོགས་པའི་དགྲ་རྣམས་ལ་གནོད་པའི་སེམས་གཅིག་ཀྱང་མི་སྐྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཚངས་པ་དང་མཚུངས། དབང་པོ་དང་མཚུངས། ལྷུན་པོ་དང་མཚུངས་ཏེ། མི་སྒུལ་བའི་སྙིང་རྗེ་ཅན། བྱམས་པ་ལ་གནས་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་གསོ་བ་ལ་མོས་པ། ཕྱིར་མི་ལྡོག་པའི་སྤྱོད་ཡུལ་བ། སེམས་ས་དང་མཚུངས་པ། སེམས་ཆུ་དང་མཚུངས་པ། སེམས་མེ་དང་མཚུངས་པ། སེམས་རླུང་དང་མཚུངས་པ། སེམས་ནམ་མཁའ་དང་མཚུངས་པ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ཐ་བ་སེལ་བ་ལ་ཞུགས་པ་ཞེས་བྱའོ། །
en: “Śāriputra, it is said that the bodhisatva’s vigor is unyielding, that the power of his vigor is unending, that he is a hero of vigor, a hero of commitment, a hero of morality, a hero of patience, a hero of concentration, a hero of wisdom. It is said that his knowledge of excellent conduct is like that of a hero. Śāriputra, when the bodhisatva is faced with hostile enemies carrying sharp weapons, he will not entertain the idea of retaliating, even for an instant. Therefore, Śāriputra, it is said that the bodhisatva is like Brahmā, like Indra, like Mount Meru. He has unyielding compassion and maintains his loving resolve to assist all sentient beings according to their needs. He has an unyielding sphere of influence and a mind that is like the earth, a mind that is like water, a mind that is like fire, a mind that is like the wind, a mind that is like space. He has succeeded in removing the evils of attachment, aversion, and confusion.

source: ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གིས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་གང་བར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་སྦྱིན་པ་བྱིན་པ་བས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་ འདི་ལྟ་བུའི་ཆོས་བདག་གིས་བསླབ་པར་བྱའོ་ཞེས་སེམས་ལ་རབ་ཏུ་བཞག་ན ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སློབ་པར་འདོད་པས་མ་བསླབས་ཀྱང་དགེ་བའི་རྩ་བ་ཆེས་མང་དུ་ཡོངས་སུ་བཟུང་བར་འགྱུར་ཏེ། སྦྱིན་པ་ཆེན་པོ་བྱིན་པས་ནི་དེ་ཙམ་མ་ཡིན་ནོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་འདིའི་ཁར་ལུས་སོ། །དེ་བས་ན་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་མཉན་པ་དང་། གཟུང་བ་དང་། ཡི་གེར་བྲི་བ་དང་། བཀླག་པ་དང་། བཅང་བ་དང་། ཕ་རོལ་ལ་ཡང་ཡང་དག་པར་རབ་ཏུ་བསྟན་པའི་ཕྱིར་བརྩོན་འགྲུས་བརྩམ་མོ། །
en: “Śāriputra, take a bodhisatva, a great being, who fills as many worlds as there are grains of sand in the river Ganges with the seven precious substances and offers this to the tathāgatas, the arhats, the fully accomplished buddhas. Contrast that with a bodhisatva, a great being, who listens to the cycle of teachings contained within The Collected Teachings on the Bodhisatva and is filled with one-pointed determination, thinking, ‘I must train according to these teachings.’ Even if he does not undertake this training, Śāriputra, the bodhisatva who wishes to undertake it gathers much more merit because of this wish than the one who makes the kind of offering I have described. Why is this? It is because, Śāriputra, this is what ensures the attainment of unsurpassed perfect awakening. Therefore, Śāriputra, the bodhisatva, the great being, vigorously pursues the study, memorization, writing, recitation, preservation, and elucidation of the cycle of teachings contained within The Collected Teachings on the Bodhisatva.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་བརྩམས་པ་ནི་འགྲོ་བ་མེད་པའི་འགྲོ་བར་འགྲོའོ། །འགྲོ་བ་མེད་པར་འགྲོ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མྱ་ངན་ལས་འདས་པ་སྟེ། དེར་བདུད་སྡིག་ཅན་འགྲོ་བ་མེད་དོ། ། དེ་བས་ན་འགྲོ་བ་མེད་པར་འགྲོ་བ་ཞེས་བྱའོ། ། དེར་འགྲོ་བ་ནི་བརྩོན་འགྲུས་དང་ལྡན་པ། སྐྱེས་བུ་དམ་པ་སངས་རྒྱས་དང་། རང་སངས་རྒྱས་དང་། ཉན་ཐོས་རྣམས་སོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། བརྩོན་འགྲུས་སྤྱོད་པའི་ལམ་དུ་ཞུགས་པ་དེ་ནི་དེ་ལྟ་བུའི་སྐྱེས་བུ་དམ་པ་དག་དང་། སངས་རྒྱས་རྣམས་སོ། །
en: “Śāriputra, having embarked on the path of vigor, the bodhisatva journeys on a voyage that is a non-voyage. What is the voyage that is a non-voyage? It is nirvāṇa. The evils of Māra cannot journey there, and that is why it is called the voyage that is a non-voyage. Those who journey there are those who have perseverance, good men, buddhas, pratyekabuddhas, and śrāvakas. Why is this? It is because it is proper engagement with the path of vigorous conduct that makes one an honorable man, a buddha.

source: གང་ལ་ལ་ཀུན་ནས་ཉོན་མོངས་པའི་ཆོས་ཅན་སེམས་ཅན་ཐམས་ཅད་ནི་གནས་གསུམ་སྟེ། གསུམ་གང་ཞེ་ན། ངན་སོང་དུ་གཞོལ་བ་དང་། ངན་སོང་དུ་འབབ་པ་དང་། ངན་སོང་དུ་བབ་པ་སྟེ། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། མང་དུ་ཐོས་པ་མ་གཏོགས་པར་མངོན་པར་འབྱུང་བའི་ཆོས་གཞན་གང་ཡང་མེད་དོ། ། ཀྱེ་མའོ་སེམས་ཅན་འདི་དག་ནི་ང་ཞེས་ཟེར་བའི་ཚིག་གི་ལམ་ལ་གནས་པ་སྟེ། ལམ་མ་ཡིན་པ་ལ་གནས་སོ། ། ཀྱེ་མའོ་སེམས་ཅན་འདི་དག་ནི་ང་ཞེས་ཟེར་བའི་བརྩོན་འགྲུས་བརྩམས་པ་སྟེ། ལེ་ལོ་ཅན་ནོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་ནི་ལམ་མ་ཡིན་པ་ལ་གནས་པའི་སེམས་ཅན་ལེ་ལོ་ཅན་དང་། མཛའ་བར་མི་བྱེད། སྟེན་པར་མི་བྱེད་དེ། གཞན་དུ་ན་བྱང་ཆུབ་སེམས་དཔའ་འཐུན་པར་སྤྱོད་པ། བརྩོན་འགྲུས་བརྩམས་པ་དང་སྟེན་པར་བྱེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ལས་གཞན་མྱ་ངན་ལས་འདས་པའི་མཆོག་གང་ཡང་མེད་དོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་བྱང་བ་ལ་མོས་ཤིང་། བརྩོན་འགྲུས་བརྩམས་པ་ནི་བདག་གི་ལུས་འབའ་ཞིག་ཉེ་བར་ཞི་བར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་མ་ཡིན་གྱི། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བའི་ཕྱིར་ཞུགས་ནས་ ཁོང་དུ་ཆུད་པར་བྱེད། སྟོན་པར་བྱེད། སྐུལ་བར་བྱེད། འཛིན་དུ་འཇུག ། འཕགས་པའི་ལམ་སྲང་དུ་འཛུད་དེ། དེ་བས་ན་སྐྱེས་བུ་དམ་པ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ། །
en: “Sentient beings take three courses. What are these three courses? They are a slope that leads toward the lower realms of existence, a hill that leads toward the lower realms of existence, or an abyss that opens into the lower realms of existence. This is the case for anyone who lives in a corrupt way. The only way to avoid these three courses is morality, patience, and learning. Oh, how lost they are, these sentient beings who go about their business thinking, ‘I’! Oh, how lazy they are, these sentient beings who vigorously pursue things thinking, ‘I’! The learned ones, Śāriputra, the bodhisatvas, do not make friends with or rely upon lazy sentient beings who are engaged in useless business. Instead, they will rely upon bodhisatvas who vigorously pursue an appropriate path of conduct. Why do they do this? Śāriputra, there is no nirvāṇa that is higher than the final nirvāṇa of a buddha. Śāriputra, the bodhisatva who has the motivation to become purified and who vigorously pursues this does not do so only to attain peace for himself, but he works with vigor for the benefit and happiness of all sentient beings. In order to be able to do this, he gains understanding, teaches them, encourages them, inspires them, and helps them onto the noble path. This is the kind of honorable man we call a bodhisatva.”

source: མདུད་པ་མེད་པའི་བརྩོན་འགྲུས་ཀྱིས། །རྟག་ཏུ་ཡང་དག་འཕགས་པར་འགྱུར། །
en: “With unrestrained vigor, He always follows the sublime.

source: མཁས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཡི། །སྡེ་སྣོད་དག་ནི་རྟག་ཏུ་འཛིན། །
en: The learned always uphold The collected teachings on the bodhisatvas.

source: ཆོས་རྣམས་ཀྱི་ནི་དོན་སེམས་ཏེ། །
en: “The meaning of these teachings

source: དེ་དག་བློ་ནི་བསམ་མི་ཁྱབ། །
en: Is something the intellect cannot fathom.

source: རྣམ་པར་བྱང་བ་ཀུན་ཚོལ་བ། །བྱང་ཆུབ་སེམས་དཔའ་བརྗོད་པ་ཡིན། །
en: Those who search for purification Are called bodhisatvas.

source: ཤེས་རབ་ཆེན་པོ་དེ་དག་འབད། །
en: “They exert themselves in great wisdom,

source: ཤིང་མཆོག་དྲུང་དུ་འདུ་འདུག་ནས་ནི། །དེ་བཞིན་ཤེས་རབ་བརྩོན་འགྲུས་ཀྱིས། །སྡིག་ཅན་བདུད་རྣམས་སྐྲག་པར་བྱེད། །
en: Taking their seat beneath the tree of excellence, And so, through the application of vigor and wisdom, They scare away the evil māras.

source: འཇིག་རྟེན་ཀུན་གྱི་བརྡ་དག་ལས། །ཚུལ་ཁྲིམས་དག་ནི་ཐམས་ཅད་སྟོན། །
en: “They all teach morality From the perspective of worldly convention.

source: སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །དེ་ལ་བརྩོན་འགྲུས་ཉམས་མི་འགྱུར། །
en: For the benefit of all sentient beings, They never let their vigor wane.

source: ཤཱ་རིའི་བུ་དུས་འདི་ལྟ་བུ་དང་། ཚོད་འདི་ལྟ་བུ་འབྱུང་བར་འགྱུར་ཏེ། གང་ང་དང་ཁྱོད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་ལྔ་བརྒྱ་པ་ཐ་མ་ལ་འདི་ལྟ་བུའི་མདོ་སྡེ་འགྲོ་བ་མང་པོ་དགའ་བ་དང་། མགུ་བར་བྱེད་པ། ཤེས་རབ་སྒྲུབ་པར་བྱེད་པ། བསོད་ནམས་སྒྲུབ་པར་བྱེད་པ། ལོངས་སྤྱོད་འཕེལ་བ་སྒྲུབ་པར་བྱེད་པ། མཐོ་རིས་སྒྲུབ་པར་བྱེད་པ། ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སྒྲུབ་པར་བྱེད་པ། མདོར་ན་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སྒྲུབ་པ། བདུད་སྐྲག་པར་བྱེད་པ། སེམས་རྣམ་པར་དག་པར་བྱེད་པ། སྐྱེ་བ་ཟད་པའི་མཐར་བྱེད་པ། སྡུག་བསྔལ་མཐར་བྱེད་པ། མྱ་ངན་ལས་འདས་པ་དང་ཉེ་བར་བྱེད་པ་འབྱུང་ན དེ་དག་དེའི་དུས་ན་སྤོང་བར་འགྱུར། མི་འདོད་པར་འགྱུར། ཡོངས་སུ་གཏོང་བར་འགྱུར་རོ། །
en: “Śāriputra, there will be a time, an occasion, after both you and I have passed away, five hundred years into the future, when this sūtra will delight and inspire a great many people. It will bring them wisdom, and it will bring them merit. It will bring them an abundance of possessions, it will lead them to heaven, and it will bring them all kinds of prosperity. It will bring them the powers, the four kinds of confidence, the analytical abilities, the great love, the great compassion, the great empathetic joy, the great equanimity, and the unique buddha qualities of a tathāgata. In short, it will bring them the teachings of the Buddha. It will chase off māras. It will purify their minds. It will put an end to birth. It will put an end to suffering. It will bring them closer to nirvāṇa. When this time comes, they will forsake the world, they will be without desires, and they will practice renunciation.

source: དེ་ལ་ཤཱ་རིའི་བུ་གང་བརྩོན་པ། རབ་ཏུ་བརྩོན་པ། མངོན་པར་རབ་ཏུ་བརྩོན་པ། བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདོད་པ། ཚུལ་ཁྲིམས་འདོད་པ། ཐོས་པ་འདོད་པ། ཏིང་ངེ་འཛིན་འདོད་པ། ཤེས་རབ་འདོད་པ། རྣམ་པར་གྲོལ་བ་འདོད་པ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་འདོད་པ། སངས་རྒྱས་ཀྱི་ཆོས་འདོད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བ་འདོད་པ། ལོག་པར་ལྟ་བ་སྤོང་བར་འདོད་པ། ཡང་དག་པར་ལྟ་བ་སྒོམ་པར་འདོད་པ། འཁོར་བ་སྤོང་བར་འདོད་པ། འཕགས་པའི་ལམ་སྒོམ་པར་འདོད་པ། ཆོས་སྟོན་པར་འདོད་པ། བདུད་སྐྲག་པར་བྱེད་པར་འདོད་པ། འདོད་ཆགས་ཞི་བར་འདོད་པ། ཞེ་སྡང་ཞི་བར་འདོད་པ། གཏི་མུག་འཇོམས་པར་འདོད་པ། མ་རིག་པ་འཇོམས་པར་འདོད་པ། རིག་པ་སྐྱེད་པར་འདོད་པའི་སེམས་ཅན་དེ་དག་འབྱུང་བར་འགྱུར་ཏེ ཤཱ་རིའི་བུ་དེ་དག་འདི་ལྟ་བུའི་ཆོས་ཐོས་ནས་དགེ་བའི་རྩ་བའི་ཆོས་ཐམས་ཅད་འདོད་པའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པར་འགྱུར་རོ། །
en: “Śāriputra, the sentient beings who will appear at that time will apply themselves; they will make an effort, they will strive. They will be interested in supreme, perfect, complete awakening. They will be interested in morality, in learning, in meditative concentration, in wisdom, in liberation, and in insight into the knowledge of liberation. They will be interested in the teachings of the Buddha. They will be interested in bringing benefit and happiness to all sentient beings. They will be unimpressed with wrong views. They will be interested in cultivating right views. They will want to relinquish cyclic existence. They will be interested in cultivating the noble path. They will want to teach the Dharma. They will want to rout the māras. They will want to quench desire. They will want to pacify anger. They will want to crush confusion. They will want to crush ignorance. They will wish to give rise to understanding. Śāriputra, having heard this type of teaching, they will apply themselves with vigor because they desire the qualities associated with the roots of virtue.

source: འདི་འདྲ་བ་ཆོས་ཐོས་ནས།
en: “As they have heard these kinds of teachings,

source: སངས་རྒྱས་ཆོས་རྣམས་ཐམས་ཅད་ནི། བར་དུ་གཅོད་པ་མི་འབྱུང་སྟེ།
en: There will be no obstacles To any of the Buddha’s qualities—

source: འདི་ལ་བདག་ནི་ཐེ་ཚོམ་མེད། །
en: Of this I have no doubt.

source: དེ་ལ་ཤཱ་རིའི་བུ་སེམས་ཅན་གང་བསོད་ནམས་ཀྱི་སྟོབས་ཀྱིས་ཉེ་བར་བརྟན་པ། ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཞུགས་པ་འབྱུང་བ་དེ་དག་འདི་ལྟ་བུའི་མདོ་སྡེ་ཉན་པར་བྱེད་དེ ཐོས་ནས་རྒྱ་ཆེར་དགའ་ཞིང་མགུ་བ་ཐོབ་པར་འགྱུར། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་རབ་ཏུ་ཀུན་ཆུབ་པར་བྱེད་པར་འགྱུར། ནན་ཏན་གྱིས་སྒྲུབ་པར་འགྱུར་རོ། །
en: “Śāriputra, the sentient beings who will appear at that time will be strongly supported by the power of their merit, and they will set out toward unsurpassed perfect awakening with the utmost resolve. They will listen to sūtras like this one, and when they hear them they will be greatly delighted and inspired. They will absorb this cycle of teachings contained in The Collected Teachings on the Bodhisatva to an exemplary degree. Because of their diligence, they will come to master it.

source: ཡང་གང་གིས་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་མཉན་པའི་ཆོས་སུ་བྱས་པར་གྱུར་པ་དེ་དག་རྒྱུ་ལ་ལ་དང་། དམིགས་པ་ལ་ལས་དབང་དུ་མ་གྱུར་པར་ཉན་པར་བྱེད་དེ། ཐོས་ནས་རྒྱ་ཆེར་དགའ་བ་དང་། མགུ་བ་ཐོབ་པར་འགྱུར། དེ་དག་དགའ་བ་དང་མགུ་བ་སྐྱེས་ནས་བརྩོན་འགྲུས་ཤིན་ཏུ་བརྟན་པ་རྩོམ་པར་འགྱུར་ཏེ། དེ་འདི་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་དཀོན་མཆོག་ལས་སྙིང་པོ་ཅུང་ཟད་ཙམ་ལེན་པར་འགྱུར་རོ། །
en: “Those who practice the Dharma by listening to the instructions of the Tathāgata will not be swayed by any kinds of circumstances, by any kinds of experiences, as they listen. When they have heard the instructions of the Tathāgata they will be greatly delighted and inspired, and because of their delight and inspiration, their vigor will grow stronger. However, they will receive only a small fraction of this jewel of the Dharma that is The Collected Teachings on the Bodhisatva.

source: འདི་ལྟ་སྟེ། དཔེར་ན་ཤཱ་རིའི་བུ་ཤིང་ཏོག་སྨིན་པ་རྣམ་པ་མང་པོ་ཁ་དོག་ཕུན་སུམ་ཚོགས་པ། དྲི་ཕུན་སུམ་ཚོགས་པ། རོ་ཕུན་སུམ་ཚོགས་པ་རྒྱ་མཚོ་ཆེན་པོས་ཁྱེར་བ་དང་། སྐྱེས་བུ་ལ་ལས་བརྩོན་འགྲུས་དང་། ཆེན་པོ་བསྐྱེད་ནས་ཆུ་ཆེན་པོར་ཞུགས་ཏེ ལག་པ་དང་། རྐང་པས་འབད་ནས་རྒྱ་མཚོ་ཆེན་པོ་དེ་ལས་ཤིང་ཏོག་གཅིག་བླངས། གཉིས་དང་གསུམ་བླངས་ནས་རྒྱ་མཚོ་ཆེན་པོ་དེ་ལས་རྒལ་ནས་དེ་ཕྱོགས་གཅིག་ཏུ་སོང་སྟེ། ཤིང་ཏོག་དེ་མྱངས་ན་དེས་སྔོན་མ་མྱོང་བའི་རོ་མྱོང་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཤིང་ཏོག་འདི་དག་ཁ་དོག་དང་ལྡན་ཞིང་ཤིང་ཏོག་འདི་དག་དྲི་དང་ལྡན། ཤིང་ཏོག་འདི་དག་རོ་དང་ལྡན་ཏེ་སྔོན་མ་མྱོང་གིས། འདི་ལྟར་བདག་གིས་བརྩོན་འགྲུས་རབ་ཏུ་བརྩམས་ཏེ། ལག་པ་དང་རྐང་པས་འབད་ནས་ཤིང་ཏོག་གཞན་ཡང་བླང་སྙམ་སྟེ། རྒྱ་མཚོ་ཆེན་པོ་དེ་ལ་ཡང་ཞུགས་པ་དང་། དེས་ཕྱི་མ་མ་མཐོང་ནས་ འདི་ལྟར་ཤིང་ཏོག་ཁ་དོག་དང་། དྲི་དང་། རོ་དང་ལྡན་ཞིང་སྨིན་པ་རྣམ་པ་སྣ་ཚོགས་དེ་དག་ལས་བདག་གིས་མང་དུ་མ་བླངས་པས་ཡོངས་སུ་ཉམས་པར་གྱུར་ཏོ་ཞེས་དེ་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་ནས་འགྱོད་དོ། །
en: “Śāriputra, say that, for example, various different kinds of ripe fruit that looked, smelled, and tasted delicious were carried around on the great ocean. A certain person, who had developed exceptional vigor and courage, might then plunge into the great ocean, struggling with arms and legs to get hold of a piece of fruit, or two or three pieces of fruit, from the great ocean, and then come out of the great ocean again. He might settle down and enjoy the fruit, comparing the taste of the fruit to the taste of fruit that he has had in the past. He might think to himself, ‘I have never had fruit this good, this sweet smelling, or this tasty before. Perhaps, if I apply myself with even greater vigor, working diligently with my arms and legs, I will be able to get more fruit like this.’ If he then goes and searches the great ocean again but does not find any more fruit, he will be upset and disappointed, and he will complain, ‘This fruit was ripe and had many good qualities. It looked, smelled, and tasted delicious. It is such a pity that I was not able to get hold of any more of this fruit.’

source: དེ་བཞིན་དུ་ཤཱ་རིའི་བུ་ཕྱི་མའི་ཚེ་ཕྱི་མའི་དུས་ལྔ་བརྒྱ་པ་ཐ་མ་ལ་དམ་པའི་ཆོས་ནུབ་པར་འགྱུར་བའི་དུས་ཀྱི་ཚེ་དད་པ་ཆུང་བ། གཏོང་བ་ཆུང་བ། ཤེས་རབ་ཆུང་བ། བརྩོན་འགྲུས་ཆུང་བ་འབྱུང་སྟེ རྣམ་གྲངས་འགའ་ཞིག་གིས་འདི་ལྟ་བུའི་མདོ་སྡེ་དཀོན་མཆོག་ཉན་པར་འགྱུར་ཏེ། ཐོས་ནས་གང་ཅུང་ཟད་ཙམ་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་འཛིན་པ་དེ་དག་ལ་བདུད་སྡིག་ཅན་ཡོངས་སུ་འཚེ་བར་འགྱུར་རོ། ། དེ་དག་ལ་སྐྱེ་བོ་མང་བོ་དགའ་བར་མི་འགྱུར། སྐྱེ་བོ་མང་པོས་མཆོད་པར་མི་འགྱུར། སྐྱེ་བོ་མང་པོས་བསྟོད་པར་མི་འགྱུར་ཏེ། མི་དགའ་མི་མཆོད། མི་བསྟོད་པར་རིག་ནས་ཡལ་བར་འདོར་རོ། ། ཡང་དེ་དག་གིས་གང་ཐོས་པར་འགྱུར་བ་དང་། ཟིན་པར་འགྱུར་བ་ཡང་ཉུང་ཞིང་དོག་ལ་ཆུང་སྟེ། མི་མང་བས་དེ་ཕྱོགས་གཅིག་ཏུ་སོང་ནས་སེམས་ལ་འཇོག་སྟེ། སེམས་ཀྱིས་ངེས་པར་རྟོག་ཅིང་དེ་དག་དགའ་བ་མི་སྐྱེ་ལ་འགྱོད་པར་འགྱུར་རོ། ། ཀྱེ་མའོ་བདག་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་མཆོག་ལས་ཡོངས་སུ་ཉམས་ཏེ། ཆོས་མང་པོར་མ་ཐོས། ཆོས་མང་པོར་མ་བཟུང་ངོ་ཞེས་དེ་དག་ཡུད་ཙམ་ཞིག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྗེས་སུ་དྲན་པར་འགྱུར་རོ། །
en: “In the same way, Śāriputra, in a future time, on a future occasion, in five hundred years time, at the time of the disappearance of the true Dharma, there will be little faith, little renunciation, little wisdom, and little vigor. Even though some people might hear a precious sūtra like this in a discourse and grasp a little bit of what they hear, even just one four-line verse, they will still be terrorized by the evil Māra. There will not be many who have respect for the true Dharma. There will not be many who worship it. There will not be many who praise it. If it is not respected, worshiped, and praised, it will be lost to oblivion. Those who do study it and understand it will be very few and far between. There will be few who will dwell in solitude in order to investigate their minds, to meditate. Those who do so will not be filled with joy but will constantly complain, ‘Oh, what a pity! The excellent instructions of the Tathāgata are fading, and I will not be able to hear any more of them. I will not be able to study any more of them.’ This is how they will remember the tathāgata, arhat, fully accomplished Buddha for some time.

source: ཤ་རིའི་བུ་གཞན་ཡང་དེའི་དུས་ན་བདུད་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་དགེ་སློང་དག་འབྱུང་བར་འགྱུར་ཏེ། གང་མདོ་སྡེ་འདི་ཐོས་ནས་སྐྱེ་བོ་མང་པོའི་མདུན་དུ་མདོ་སྡེ་འདི་ནི་རང་བཟོར་བྱས་པ་ཡིན་ཏེ། འདི་ནི་སངས་རྒྱས་ཀྱིས་གསུངས་པ་མ་ཡིན་ན་ཞེས་སྤོང་བར་འགྱུར་རོ། ། ཡང་ཤཱ་རིའི་བུ་དེའི་དུས་ན་དགེ་སློང་གང་ཐམས་ཅད་ཡོང་མི་ཉན་པ་དག་ཀྱང་འབྱུང་བར་འགྱུར་རོ། །
en: “Moreover, Śāriputra, at that time there will be mendicants who will be under the sway of Māra, and who, when they hear this discourse, will publicly contest its authenticity, saying that this discourse is not the word of the Buddha. Śāriputra, at that time there will even be mendicants who will not want to hear anything of it.”

source: འདི་འདྲ་བ་ཡི་ཆོས་ཐོས་ནས། །
en: “As they have heard these kinds of teachings,

source: བར་དུ་གཅོད་པར་ཡོང་མི་འགྱུར། །
en: There will be no obstacles

source: སངས་རྒྱས་ཀྱི་ནི་ཆོས་ཐམས་ཅད། །དེ་ལ་བདག་ནི་ནེམ་ནུར་མེད། །
en: To any of the Buddha’s teachings—Of this I have no doubt.

source: གང་དག་བསོད་ནམས་ཆུང་འབྱུང་བ། །དེ་དག་འདི་འདྲ་ཉན་མི་འགྱུར། །
en: “There will be those who have little merit Who will not listen to something like this.

source: གང་དག་བསོད་ནམས་ཆུང་འབྱུང་བ། །ཐོས་ནས་དད་པར་མི་འགྱུར་རོ། །
en: There will be those who have little merit Who will not develop faith in it when they hear it.

source: གང་དག་བསོད་ནམས་ལྡན་འབྱུང་བ། ཐོས་ནས་དད་པས་འཛིན་པར་འགྱུར།
en: “There will be those who possess merit Who will hear it and preserve it with faith.

source: གང་དག་བསོད་ནམས་ཆུང་འབྱུང་བ། འདི་ནི་བསྟན་པ་མིན་ཞེས་ཟེར། །
en: “There will be those who have little merit Who will claim that it is not the Teaching.

source: དེ་དག་ངན་འགྲོར་འགྲོ་བར་འགྱུར། །
en: They will go to the lower realms of existence

source: ས་ཡི་སྟེང་ན་དམུས་ལོང་བཞིན། །
en: And will be like blind people crawling on the ground.

source: བསོད་ནམས་ལྡན་འབྱུང་དེ་དག་ནི། །ཐོས་ནས་རབ་ཏུ་དགའ་བར་འགྱུར། །
en: “Those who have merit Will hear it and be overjoyed.

source: བདེ་འགྲོ་བར་ནི་དེ་དག་འགྲོ། །
en: They will go to pleasurable states of existence,

source: སྤྲིས་མ་མར་གྱི་སྙིང་པོ་བཞིན། །
en: Which are like the essence of clarified butter.

source: གང་དག་བསོད་ནམས་ཆུང་འབྱུང་བ། །ཐོས་ནས་ཡིད་ནི་མི་བདེར་འགྱུར། །
en: “There will be those who have little merit Who will become depressed when they hear it.

source: དེ་དག་ཡུན་རིང་སྡུག་བསྔལ་ཏེ། །
en: They will suffer for a long time,

source: མི་ཤེས་པས་ན་གྲོལ་མི་འགྱུར། །
en: And, being ignorant, they will not be liberated.

source: ཉུང་དུ་ཐོས་པ་ཁ་ཅིག་ནི། །དེ་དག་བདུད་ཀྱིས་ཡོངས་སུ་གཙེས། །
en: “There will be a few who will be Terrorized by māras when they hear it.

source: སངས་རྒྱས་བྱང་ཆུབ་སྤངས་གྱུར་ནས། །
en: They will abandon the awakening of the Buddha;

source: མྱུར་དུ་སེམས་ཅན་དམྱལ་བར་འགྲོ། །
en: They soon end up in hell.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ནི་རྣམ་པར་དག་པ་སྟེ། ཤཱ་རིའི་བུ་འཁོར་བཞི་ལས་གང་ལ་ལ་ཐ་ན་དགེ་སློང་གཅིག་གམ། དགེ་སློང་མ་གཅིག་གམ། དགེ་བསྙེན་གཅིག་གམ། དགེ་བསྙེན་མ་གཅིག་ཀྱང་། སངས་རྒྱས་ཀྱི་ཆོས་ནུབ་པར་འགྱུར་བའི་དུས་ཀྱི་ཚེ་ན་འདི་ལྟ་བུའི་མདོ་སྡེ་མཉན་ཏེ ཐོས་ནས་ ནན་ཏན་བྱེད་ཅིང་འཛིན་པར་འགྱུར་བ་དང་། གང་གིས་ཐོས་ནས་ སྤོང་བར་འགྱུར་བ་དང་། གང་ཐམས་ཅད་ཡོང་ཉན་པར་མི་འགྱུར་བ་དེ་ཀུན་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། དེ་ལ་གང་ཐོས་ནས་ནན་ཏན་བྱེད་ཅིང་འཛིན་པར་འགྱུར་བ་དེ་དག་སྒྲིབ་པ་མེད་ཅིང་ཡོངས་སུ་དག་པ་བཞི་དང་ལྡན་པར་འགྱུར་རོ། ། བཞི་གང་ཞེ་ན། ཚུལ་ཁྲིམས་རྣམ་པར་དག་ཅིང་སྒྲིབ་པ་མེད་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། དལ་བ་འབྱོར་པ་སོ་སོར་ཐོབ་པ་རྣམ་པར་དག་ཅིང་སྒྲིབ་པ་མེད་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། སངས་རྒྱས་མངོན་སུམ་དུ་མཐོང་སྟེ འགྲོགས་པ་རྣམ་པར་དག་པ་སྒྲིབ་པ་མེད་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་བྱམས་པ་མཐོང་ནས་མཐོང་མ་ཐག་ཏུ་རྣམ་པར་དག་ཅིང་སྒྲིབ་པ་མེད་པར་འགྱུར་ཏེ། ཇི་ལྟར་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དང་། ཇི་ལྟར་སྦྱོར་བ་དེ་བཞིན་དུ་སོ་སོར་མྱོང་བར་འགྱུར་ཏེ། ཤཱ་རིའི་བུ་རྣམ་པར་དག་ཅིང་སྒྲིབ་པ་མེད་པ་བཞི་པོ་དེ་དག་དང་ལྡན་པར་འགྱུར་རོ། །
en: “Śāriputra, the knowledge of the Tathāgata is completely pure. Śāriputra, the Tathāgata knows of everyone who will hear sūtras like this one at the time of the disappearance of the Dharma of the buddhas. He knows whether they will belong to one of the four assemblies, whether they will be a monk, a nun, a layman, or a laywoman. He knows who will practice it and gain a good grasp of it when they hear it, and who will disregard it and want to hear nothing of it. Those who practice it and gain a good grasp of it when they hear it will gain four things that will free them from obstructions and purify them. What are these four things? They will gain morality, which will free them from obstructions and purify them. They will gain freedom and riches and the opportunities these things bring, which will free them from obstructions and purify them. They will gain the opportunity to meet and listen to a buddha, and this will free them from obstructions and purify them. They will see the Buddha Maitreya, and when they see him they will be freed from obstructions and be purified. Śāriputra, these are the four things they will gain that will free them from obstructions and purify them. They will each experience these things in accordance with the roots of virtue that they have planted.
